
[[Set-Union]]
# Set Union
:concept: Expressions/Values/Set/Union

.Synopsis
Union of two set values.



.Syntax

.Types

|====
| `_Exp~1~_`    |  `_Exp~2~_`    | `_Exp~1~_ + _Exp~2~_`      

| `set[_T~1~_]` |  `set[_T~2~_]` | `set[lub(_T~1~_,_T~2~_)]`  
|====

.Description
The `+` operator computes set union if both operands are sets. If one of the operands is not a set, it acts as <<Set-Insert>> instead.

.Examples
[source,rascal-shell]
----
rascal>{1, 2, 3} + {4, 5, 6};
set[int]: {5,1,3,2,4,6}
rascal>{1,2,3} + {2,3,4};
set[int]: {1,3,2,4}
rascal>{1, 2, 3} + {3};
set[int]: {1,3,2}
rascal>{2} + { 2, 3, 4};
set[int]: {3,2,4}
----


:leveloffset: +1

:leveloffset: -1