[[Boolean-IfDefinedElse]]
# Boolean IfDefinedElse
:concept: Expressions/Values/Boolean/IfDefinedElse

.Synopsis
Test whether expression has a defined value, otherwise provide alternative.

.Syntax
`_Exp_~1~ ? _Exp_~2~`

.Types

//

|====
| `_Exp~1~_` | `_Exp~2~_` | `_Exp~1~_ ? _Exp~2~_`

| `_T~1~_`   | `_T~2~_`   |  `_T~2~_ <: _T~1~_` 
|====

.Function

.Description
If no exception is generated during the evaluation of _Exp_~1~, the result of `_Exp_~1~ ? _Exp_~2~` is the value of _Exp_~1~.
Otherwise, it is the value of _Exp_~2~.

Also see <<Boolean isDefined>> and <<Assignment>>.

.Examples
This test can, for instance, be used to handle the case that a certain key value is not in a map:
[source,rascal-shell-error]
----
rascal>T = ("a" : 1, "b" : 2);
map[str, int]: ("a":1,"b":2)
----
Trying to access the key `"c"` will result in an error:
[source,rascal-shell-error]
----
rascal>T["c"];
NoSuchKey("c") at |test-modules:///ConsoleInput.rsc|(53,6,<4,15>,<4,21>)
Call stack (most recent first):
	main([]) at |test-modules:///ConsoleInput.rsc|(53,6,<4,15>,<4,21>)

ok
----
Using the `?` operator, we can write:
[source,rascal-shell-error]
----
rascal>T["c"] ? 0;
int: 0
----
This is very useful, if we want to modify the associated value, but are not sure whether it exists:
[source,rascal-shell-error]
----
rascal>T["c"] ? 0 += 1;
map[str, int]: ("a":1,"b":2,"c":1)
----
Another example using a list:
[source,rascal-shell-error]
----
rascal>L = [10, 20, 30];
list[int]: [10,20,30]
rascal>L[4] ? 0;
int: 0
----
It is, however, not possible to assign to index positions outside the list.

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1