
[[Number-LessThan]]
# Number LessThan
:concept: Expressions/Values/Number/LessThan

.Synopsis
Less than operator on numeric values.

.Syntax
`_Exp_~1~ < _Exp_~2~`

.Types


|====
| `_Exp~1~_`  |  `_Exp~2~_` | `_Exp~1~_ < _Exp~2~_` 

| `int`      |  `int`     | `bool`              
| `int`      |  `real`    | `bool`              
| `real`     |  `real`    | `bool`              
|====

.Function

.Description
Yields `true` if the value of _Exp~1~_ is numerically less than the value of _Exp~2~_, and `false` otherwise.

.Examples
[source,rascal-shell]
----
rascal>13 < 12
bool: false
rascal>12 < 13
bool: true
rascal>13.5 < 12
bool: false
rascal>12.5 < 13
bool: true
----

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1