
[[Map-Comprehension]]
# Map Comprehension
:concept: Expressions/Values/Map/Comprehension

.Synopsis
A map comprehension generates a map value.

.Syntax
`( _Exp_~1~ : _Exp_~2~ | _Gen_~1~, _Gen_~2~, ... )`

.Types


|====
| `_Exp~1~_` | `_Exp~2~_` | `( _Exp~1~_ : _Exp~2~_ \| _Gen~1~_, _Gen~2~_, ... )` 

| `_T~1~_`   | `_T~2~_`   | `map[_T~1~_, _T~2~_]`                              
|====

.Function

.Description
A map comprehension consists of a number of two contributing expressions _Exp_~1~ (for key values), 
and _Exp_~2~ (the values associated with those key values) and a number of
generators _Gen_~1~, _Gen_~2~, _Gen_~3~, ... that are evaluated as described in <<Expressions-Comprehensions>>.

.Examples
[source,rascal-shell]
----
----
Introduce a map of `fruits`:
[source,rascal-shell]
----
rascal>fruits = ("pear" : 1, "apple" : 3, "banana" : 0, "berry" : 25, "orange": 35);
map[str, int]: ("banana":0,"pear":1,"orange":35,"berry":25,"apple":3)
rascal>import String;
ok
----
Use a map comprehension to filter fruits with a name of at most 5 characters:
[source,rascal-shell]
----
rascal>(fruit : fruits[fruit] | fruit <- fruits, size(fruit) <= 5);
map[str, int]: ("pear":1,"berry":25,"apple":3)
----
Use a map comprehension to filter fruits with an associated value larger than 10:
[source,rascal-shell]
----
rascal>(fruit : fruits[fruit] | fruit <- fruits, fruits[fruit] > 10);
map[str, int]: ("orange":35,"berry":25)
----

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1