
[[Number-Division]]
# Number Division
:concept: Expressions/Values/Number/Division

.Synopsis
Division on numeric values.

.Syntax
`_Exp_~1~ / _Exp_~2~`

.Types


|====
| `_Exp~1~_`  |  `_Exp~2~_` | `_Exp~1~_ / _Exp~2~_`  

| `int`      |  `int`     | `int`                
| `int`      |  `real`    | `real`               
| `real`     |  `real`    | `real`               
|====

.Function

.Description
Yields the result of dividing the value of _Exp~1~_ by the value of _Exp~2~_.

.Examples
[source,rascal-shell-error]
----
rascal>12 / 3
int: 4
rascal>10 / 3
int: 3
rascal>12 / 3.0
real: 4.
rascal>10 / 3.0
real: 3.333333333
rascal>12 / 0
ArithmeticException("/ by zero") at |test-modules:///ConsoleInput.rsc|(36,6,<3,15>,<3,21>)
Call stack (most recent first):
	main([]) at |test-modules:///ConsoleInput.rsc|(36,6,<3,15>,<3,21>)

ok
----

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1