
[[Values-Range]]
# Range
:concept: Expressions/Values/Range

.Synopsis
Numeric range of values.

.Syntax

*  `[ _Exp~1~_ .. _Exp~3~_ ]`
*  `[ _Exp~1~_, _Exp~2~_ .. _Exp~3~_ ]`

.Types

.Function

.Description
Ranges are a shorthand for describing lists of integers from 
_Exp_~1~ up to (exclusive) _Exp_~3~ with increments of 1.
When _Exp_~2~ is present it is taken as the second element of the list
and _Exp_~2~ - _Exp_~1~ is used as increment for the subsequent list elements.

A range with integer expressions is identical to a list <<List Slice>>.
However, a range may also contain numeric expressions that are not integers.

.Examples
[source,rascal-shell]
----
rascal>[1 .. 10];
list[int]: [1,2,3,4,5,6,7,8,9]
rascal>[1, 3 .. 10];
list[int]: [1,3,5,7,9]
rascal>[0.5, 3.2 .. 10];
list[real]: [0.5,3.2,5.9,8.6]
rascal>[1, -2 .. -10];
list[int]: [1,-2,-5,-8]
----

.Benefits
Ranges are mostly used to loop over ranges of integers.

.Pitfalls
In some cases ranges are empty where one could have expected at least one element:
[source,rascal-shell]
----
rascal>[1, 3 .. -10];
list[void]: []
----


:leveloffset: +1

:leveloffset: -1