
[[Set-Insert]]
# Set Insert
:concept: Expressions/Values/Set/Insert

.Synopsis
Add an element to a set.



.Syntax
`_Exp_~1~ + _Exp_~2~`

.Types


|====
| `_Exp~1~_`    |  `_Exp~2~_`    | `_Exp~1~_ + _Exp~2~_`      

| `set[_T~1~_]` |  `_T~2~_`      | `set[lub(_T~1~_,_T~2~_)]`  
| `_T~1~_`      |  `set[_T~2~_]` | `set[lub(_T~1~_,_T~2~_)]`  
|====

.Function

.Description

The `+` operator will add elements to sets.

.Examples
[source,rascal-shell]
----
rascal>{1, 2, 3} + 4;
set[int]: {1,3,2,4}
rascal>1 + { 2, 3, 4};
set[int]: {1,3,2,4}
rascal>{1} + 1;
set[int]: {1}
rascal>1 + {1};
set[int]: {1}
----

.Benefits

.Pitfalls

*  if both operands of `+` are a set then it acts as <<Set-Union>>.


:leveloffset: +1

:leveloffset: -1